import json

data = {
    "Іваненко": ["Іван", "Іванович", 2000],
    "Петренко": ["Петро", "Петрович", 1999],
    "Сидоренко": ["Сидір", "Сидорович", 2001],
    "Коваленко": ["Максим", "Ігорович", 1998],
    "Бондаренко": ["Анна", "Іванівна", 2002],
    "Ткаченко": ["Марія", "Петрівна", 2000],
    "Мельник": ["Ігор", "Олексійович", 1997],
    "Шевченко": ["Тарас", "Григорович", 1995],
    "Кравченко": ["Олена", "Сергіївна", 2003],
    "Поліщук": ["Андрій", "Васильович", 1996]
}

with open("data.json", "w", encoding="utf-8") as f:
    json.dump(data, f, ensure_ascii=False, indent=4)

with open("data.json", "r", encoding="utf-8") as f:
    loaded = json.load(f)

print("Зчитані дані:\n")

for k, v in loaded.items():
    print(k, v)